snlkuharlocal/src/Documents/ПрайсЛист/ПрайсЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрайсЛист</name>
  <basedOn>Document.ЗаявкаНаУстановкуЦен</basedOn>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата2</name>
    <comment>Дата окончания действия прайса</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньДоступа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Акция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ЗаявкаНаУстановкуЦен</types>
      <types>DocumentRef.РасчетЦен</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Брэнд</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Брэнд</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТовара</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньДоступа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Прайс</name>
    <type>
      <types>DocumentRef.ПрайсЛист</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Documents/ПрайсЛист/ObjectModule.bsl
Перем ЕстьИзменения;
Перем НадоПерезаписыватьЦены;

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	НадоПерезаписыватьЦены = Ложь;
	ЕстьИзменения = Модифицированность();	
	
	Если НЕ ОбменДанными.Загрузка Тогда
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ);	
		
		Если Отказ Тогда Возврат КонецЕсли;
		
		Если Дата<>Ссылка.Дата ИЛИ ТипЦен<>Ссылка.ТипЦен Тогда
			НадоПерезаписыватьЦены=Истина;
		КонецЕсли; 
		
		
	КонецЕсли;
	
	Если УровеньДоступа <> ТипЦен.УровеньДоступа Тогда
		УровеньДоступа = ТипЦен.УровеньДоступа;		
	КонецЕсли;
	
	УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
	УстановитьПолучателейИзмененийОбъектаВнешние(ЭтотОбъект);
	
	Если ЕстьИзменения И НЕ ЭтоНовый() Тогда
		ДополнительныеСвойства.Вставить("ОтправитьОповещение", Истина);
	КонецЕсли;
	
	Если НЕ ЕстьИзменения Тогда Возврат КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)	
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если НадоПерезаписыватьЦены Тогда
		Набор = РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
		Набор.Отбор.Прайс.Установить(Ссылка);
		Набор.Прочитать();
		
		ВсегоЗаписей=Набор.Количество();
		
		Для Каждого Запись Из Набор Цикл 
			#ЕСЛИ КЛИЕНТ ТОГДА 
				Состояние("Осталось: "+ВсегоЗаписей);
			#КОНЕЦЕСЛИ
			
			ВсегоЗаписей = ВсегоЗаписей-1;
			
			Если Запись.Период<>НачалоДня(Дата) Тогда
				Запись.Период=Дата;		
			КонецЕсли;		
			Если Запись.ТипЦен<>ТипЦен Тогда
				Запись.ТипЦен=ТипЦен;		
			КонецЕсли; 
		КонецЦикла;	
		Если Набор.Модифицированность() Тогда
			Набор.Записать();	
		КонецЕсли;				
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда Возврат; КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаУстановкуЦен") Тогда
	
		ДокОснование = ДанныеЗаполнения;
		Автор = ПараметрыСеанса.Пользователь;
		
		МассивПолей = Новый Массив;
		МассивПолей.Добавить("Дата");
		МассивПолей.Добавить("Комментарий");
		//крохин начало 03.11.2022
		//тип цен теперь грузится из ЦО_ФР
		МассивПолей.Добавить("ТипЦен");
		//крохин конец 03.11.2022
		ЗначенияРеквизитовОснования = ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, СтрСоединить(МассивПолей, ","));
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЗначенияРеквизитовОснования);
		
		Валюта = ТипЦен.Валюта;
	    Курс = ПолучитьКурсВалюты_ПоРусски(Валюта, ТекущаяДата());
		
		Организация = Справочники.Организации.НайтиПоКоду("SS-001");
        ИБ = Справочники.ИБ.НайтиПоКоду("SSP");
		
		Дата2 = Дата;
		
		//крохин начало 03.11.2022
		//тип цен теперь грузится из ЦО_ФР
		//ТипЦен = ?(ЗначениеЗаполнено(ДанныеЗаполнения.Подразделение), ДанныеЗаполнения.Подразделение.РозничныйТипЦен, ДанныеЗаполнения.ТипЦен);
		Если ТипЦен.Пустая() тогда
		ТипЦен = ?(ЗначениеЗаполнено(ДанныеЗаполнения.Подразделение), ДанныеЗаполнения.Подразделение.РозничныйТипЦен, ДанныеЗаполнения.ТипЦен);	
		Валюта = ТипЦен.Валюта;
	    Курс = ПолучитьКурсВалюты_ПоРусски(Валюта, ТекущаяДата());
		КонецЕсли;
		//крохин конец 03.11.2022
		
	КонецЕсли;

КонецПроцедуры
